#+nosetuplobfile: yes

* General Properties and Settings
:PROPERTIES:
:header-args:text+: :results raw replace drawer :exports results
:ID:       c821137f-41fe-46e8-aeb6-bb288400d272
:CUSTOM_ID:       c821137f-41fe-46e8-aeb6-bb288400d272
:END:

If setting this up again, use ~C-c C-c~ on the results of the ~emacs-lisp~ code block; taken from [[https://emacs.stackexchange.com/users/91/mankoff][mankoff's]] answer [[https://emacs.stackexchange.com/a/60223/31428][here]]:

#+name: eedc8905-e04c-40d9-97c1-88b840473eaf
#+begin_src text
#+property: header-args -n -r -l "[{(<%s>)}]" :noweb yes :mkdirp yes :cache yes
# #+property: header-args -n -r -l "[{(<%s>)}]" :tangle-mode (identity #o444) :noweb yes :mkdirp yes :cache yes
# #+property: header-args:emacs-lisp+ :comments both
#+end_src

#+RESULTS: eedc8905-e04c-40d9-97c1-88b840473eaf
:results:
#+property: header-args -n -r -l "[{(<%s>)}]" :noweb yes :mkdirp yes :cache yes
# #+property: header-args -n -r -l "[{(<%s>)}]" :tangle-mode (identity #o444) :noweb yes :mkdirp yes :cache yes
# #+property: header-args:emacs-lisp+ :comments both
:end:

Adapted from [[https://stackoverflow.com/users/776405/whil][Whil's]] answer [[https://stackoverflow.com/a/65232183/10827766][here]]:

#+name: de0dd529-e632-4a70-b31b-8830795d51b7
#+begin_src text
#+startup: show3levels
#+end_src

#+RESULTS: de0dd529-e632-4a70-b31b-8830795d51b7
:results:
#+startup: show3levels
:end:

* HTML Export Options
:PROPERTIES:
:header-args:text+: :results raw replace drawer :exports results
:ID:       0ee9b692-e89d-46f4-9f34-bffa599bf068
:CUSTOM_ID:       0ee9b692-e89d-46f4-9f34-bffa599bf068
:END:

More options can be found [[https://orgmode.org/manual/Export-Settings.html][on the orgmode website]]:

#+name: 20220212070000334862280
#+begin_src text
#+options: num:nil html-style:nil pri:t
#+end_src

#+RESULTS: 20220212070000334862280
:results:
#+options: num:nil html-style:nil pri:t
:end:

** Mathjax

More ~mathjax~ options can be found [[https://orgmode.org/manual/Math-formatting-in-HTML-export.html][on the orgmode website]] and [[http://doc.endlessparentheses.com/Var/org-html-mathjax-options.html][doc.endlessparentheses.com]]:

#+name: 20220212070406770093600
#+begin_src text
#+html_mathjax: align: left indent: 5%
#+end_src

#+RESULTS: 20220212070406770093600
:results:
#+html_mathjax: align: left indent: 5%
:end:

** HTML Headers
:PROPERTIES:
:header-args:html+: :noweb-ref html-head
:END:

More ~html~ options can be found on the orgmode website:
- https://orgmode.org/manual/HTML-specific-export-settings.html
- https://orgmode.org/manual/Publishing-options.html#:~:text=HTML%20specific%20properties
- https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#org2656e9f
- https://orgmode.org/guide/HTML-Export.html
- https://orgmode.org/manual/Quoting-HTML-tags.html

Adapted from [[https://raw.githubusercontent.com/alhassy/alhassy.github.io/master/AlBasmala.org#:~:text=HTML%2DPreamble%0A%20%20%3AEND%3A-,%23%2BBEGIN_SRC%20emacs%2Dlisp%20%3Aexports%20results%20%3Aresults%20raw%20replace%20drawer,-(s%2Djoin%20%22%5Cn][here]]:

#+begin_src hy :results raw replace drawer :exports results
(.join "\n" (gfor line (.split #[html-head[
<<html-head>>]html-head] "\n") (+ "#+html_head: " line)))
#+end_src

#+RESULTS:
:results:
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/gh/sylvorg/bundle@main/src/styles/primary/syvl.css" />
#+html_head: <link rel="icon" href="https://cdn.jsdelivr.net/gh/sylvorg/bundle@main/src/icons/favicons/shiny-zigzagoon-galar.ico" sizes="any" />
#+html_head: <link rel="icon" href="https://cdn.jsdelivr.net/gh/sylvorg/bundle@main/src/icons/favicons/shiny-zigzagoon-galar.svg" />
#+html_head: <link rel="manifest" href="https://cdn.jsdelivr.net/gh/sylvorg/bundle@main/manifest.json" />
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.7.0/build/styles/paraiso-dark.min.css" />
#+html_head: <script src="https://cdn.jsdelivr.net/gh/sylvorg/bundle@main/src/scripts/highlight/highlight.min.js"></script>
#+html_head: <script>hljs.highlightAll();</script>
#+html_head: <div class="header">
#+html_head: <h1>We Are Syvlorg.</h1>
#+html_head: <a href="">About Me</a>
#+html_head: <a href="">About This Website</a>
#+html_head: <a href="">About Syvlorg</a>
#+html_head: <a href="https://resume.syvl.org">Résumé</a>
#+html_head: <a href="https://index.syvl.org">Index</a>
#+html_head: </div>
:end:

